# Напишите функцию, которая «переворачивает» число,
# то есть возвращает число, в котором цифры стоят в обратном порядке.
# Вводится натуральное число
# Пользоваться input()[::-1] запрещено!
# Идея задачи реализовать алгоритм,
# который будет работать для любого введенного натурального числа.
n = int(input())


def revers(n):
    n2 = 0
    while n != 0:
         f = n % 10
         n = n // 10
         n2 *= 10
         n2 += f
    return(n2)
print(revers(n))