# Напишите функцию number_to_words(num), которая принимает
# в качестве аргумента натуральное число num и возвращает
# его словесное описание на русском языке.
#
# Примечание 1.
# Считайте, что число 1 ≤ num ≤ 99.
#
# Примечание 2.
# Следующий программный код:
#
# print(number_to_words(7))
# print(number_to_words(85))
# должен выводить:
#
# семь
# восемьдесят пять
s1 = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
s2 = ["одинадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шеснадцать", "семнадцать", "восемнадцать", "девятнадцать"]
s3 = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]

def ntw(n):
    if n == 11:
        print("одинадцать")
    elif n == 12:
        print("двенадцать")
    elif n == 13:
        print("тринадцать")
    elif n == 14:
        print("четырнадцать")
    elif n == 15:
        print("пятнадцать")
    elif n == 16:
        print("шеснадцать")
    elif n == 17:
        print("семнадцать")
    elif n == 18:
        print("восемнадцать")
    elif n == 19:
        print("девятнадцать")
    elif n < 10:
        print(s1[n - 1])
    elif n > 20:
        print(s3[(n//10) - 1])